# -*- coding: utf-8 -*-
# @Project: 芒果测试平台
# @Description: 
# @Time   : 2024-09-23 16:23
# @Author : 毛鹏
from mangokit.mango.mango import Mango

if __name__ == '__main__':
    text = """
            各位同事, 大家好:
            测试套ID：123456789任务执行完成，执行结果如下:
            用例运行总数: 83 个
            通过用例个数: 58 个
            失败用例个数: 0 个
            异常用例个数: 0 个
            跳过用例个数: 暂不统计 个
            成  功   率: 69.88 %


        **********************************
        芒果自动化平台地址：http://10.10.17.179:5173
        详细情况可前往芒果自动化平台查看，非相关负责人员可忽略此消息。谢谢！
    """
    Mango.s(text)
