Repository: pypi-data/pypi-mirror-297
Catalog: packages/HyperKitty/hyperkitty-1.3.12.tar.gz/hyperkitty-1.3.12/hyperkitty/locale/*/LC_MESSAGES/django.po
Languages: eo

source: Add a tag...
eo: Aldoni etikedon…

source: Add
eo: Aldoni

source: use commas to add multiple tags
eo: Uzu komojn por aldoni plurajn etikedojn

source: Attach a file
eo: Alkroĉi dosieron

source: Attach another file
eo: Alkroĉi alian dosieron

source: Remove this file
eo: Dekroĉi ĉi tiun dosieron

source: Error 404
eo: Eraro 404

source: Oh No!
eo: Ho ve!

source: I can't find this page.
eo: Mi ne povas trovi ĉi tiun paĝon.

source: Go back home
eo: Reen hejmen

source: Error 500
eo: Eraro 500

source: Sorry, but the requested page is unavailable due to a server hiccup.
eo: Pardonu, sed la petita paĝo estas neatingebla pro servila problemo.

source: started
eo: komencita

source: last active:
eo: laste aktiva je:

source: see this thread
eo: vidi ĉi tiun fadenon

source: (no suggestions)
eo: (sen sugestoj)

source: Sent just now, not yet distributed
eo: Ĵus sendita, ankoraŭ ne distribuita

source: Formats
eo: Dosierformoj

source: To change the format, just add <em>?format=&lt;FORMAT&gt;</em> to the URL.
eo: Por ŝanĝi la formon, postmetu <em>?format=&lt;FORMAT&gt;</em> post la retpaĝa adreso.

source: The list of available formats is:
eo: Jen la listo de haveblaj dosierformoj:

source: Plain text
eo: Ordinara teksto

source: List of mailing-lists
eo: Listo de dissendolistoj

source: Endpoint:
eo: Finpunkto:

source: Threads in a mailing list
eo: Fadenoj en dissendolisto

source: Emails in a thread
eo: Retmesaĝoj en fadeno

source: An email in a mailing list
eo: Retmesaĝo en dissendolisto

source: Tags
eo: Etikedoj

source: Account
eo: Konto

source: Mailman settings
eo: Agordoj pri Mailman

source: Posting activity
eo: Afiŝa aktiveco

source: Logout
eo: Adiaŭi

source: Sign In
eo: Saluti

source: Sign Up
eo: Registri vin

source: Manage this list
eo: Administri ĉi tiun liston

source: Manage lists
eo: Administri listojn

source: Search this list
eo: Serĉi ĉi tiun liston

source: Search all lists
eo: Serĉi ĉiujn listojn

source: Keyboard Shortcuts
eo: Fulmoklavoj

source: Thread View
eo: Fadena vido

source: Next unread message
eo: Sekva nelegita mesaĝo

source: Previous unread message
eo: Malsekva nelegita mesaĝo

source: Jump to all threads
eo: Salti al ĉiuj fadenoj

source: Jump to MailingList overview
eo: Salti al superrigardo pri dissendolisto

source: Powered by
eo: Funkcianta per

source: version
eo: versio

source: Not implemented yet
eo: Ankoraŭ ne realigita

source: Not implemented
eo: Ne realigita

source: This feature has not been implemented yet, sorry.
eo: Jen nerealigita funkcio, bedaŭrinde.

source: Error: private list
eo: Eraro: privata listo

source: This mailing list is private. You must be subscribed to view the archives.
eo: Jen privata dissendolisto. Vi devas aboni por vidi la arĥivojn.

source: You like it (cancel)
eo: Vi ŝatas ĝin (nuligi)

source: You dislike it (cancel)
eo: Vi malŝatas ĝin (nuligi)

source: You must be logged-in to vote.
eo: Vi devas saluti por voĉdoni.

source: Threads by
eo: Fadenoj laŭ

source: month
eo: monato

source: New messages in this thread
eo: Novaj mesaĝoj en ĉi tiu fadeno

source: All Threads
eo: Ĉiuj fadenoj

source: See the profile
eo: Vidi la profilon

source: posts
eo: afiŝoj

source: No posters this month (yet).
eo: Neniu afiŝinto ĉi-monate (ankoraŭ).

source: This message will be sent as:
eo: Ĉi tiu mesaĝo sendiĝos kiel:

source: Change sender
eo: Ŝanĝi sendinton

source: Link another address
eo: Ligi alian adreson

source: List overview
eo: Superrigardo pri listo

source: Download
eo: Elŝuti

source: Past 30 days
eo: Lastaj 30 tagoj

source: This month
eo: Ĉi monato

source: Entire archive
eo: Tuta arĥivo

source: Available lists
eo: Haveblaj listoj

source: Sort by number of recent participants
eo: Ordigi laŭ nombro de lastaj partoprenantoj

source: Most popular
eo: Plej populara

source: Sort by number of recent discussions
eo: Ordigi laŭ nombro de lastaj diskutoj

source: Most active
eo: Plej aktiva

source: Sort alphabetically
eo: Ordigi alfabete

source: By name
eo: Laŭ nomo

source: Sort by list creation date
eo: Ordigi laŭ dato de kreo de listo

source: Newest
eo: Plej nova

source: Sort by
eo: Ordigi laŭ

source: Hide inactive
eo: Kaŝi neaktivajn

source: Hide private
eo: Kaŝi privatajn

source: Find list
eo: Trovi liston

source: new
eo: nova

source: private
eo: privata

source: inactive
eo: neaktiva

source: Loading...
eo: Ŝargante…

source: No archived list yet.
eo: Neniu enarĥivigita listo ankoraŭ.

source: List
eo: Listo

source: Description
eo: Priskribo

source: Activity in the past 30 days
eo: Aktiveco dum la lastaj 30 tagoj

source: participants
eo: partoprenantoj

source: discussions
eo: diskutoj

source: Delete MailingList
eo: Forviŝi dissendoliston

source: Delete Mailing List From HyperKitty
eo: Forviŝi dissendoliston for de HyperKitty

source: Delete
eo: Forviŝi

source: or
eo: aŭ

source: cancel
eo: nuligi

source: thread
eo: fadeno

source: Delete message(s)
eo: Forviŝi mesaĝo(j)n

source: Create a new thread
eo: Krei novan fadenon

source: in
eo: en

source: Send
eo: Sendi

source: See the profile for %(name)s
eo: Vidi la profilon de %(name)s

source: Unread
eo: Nelegita

source: Sender's time:
eo: Horo de sendinto:

source: New subject:
eo: Nova temo:

source: Attachments:
eo: Alkroĉaĵoj:

source: Display in fixed font
eo: Montri per egallarĝa tiparo

source: Permalink for this message
eo: Daŭra hiperligo de ĉi tiu mesaĝo

source: Reply
eo: Respondi

source: %(email.attachments.count)s attachment
eo: %(email.attachments.count)s alkroĉaĵo

source: Sign in to reply online
eo: Ensalutu por respondi rete

source: Use email software
eo: Uzi retpoŝtan programon

source: Quote
eo: Citi

source: Create new thread
eo: Krei novan fadenon

source: Back to the thread
eo: Reen al la fadeno

source: Back to the list
eo: Reen al la listo

source: Delete this message
eo: Forviŝi ĉi tiun mesaĝon

source: by %(name)s
eo: laŭ %(name)s

source: Recent
eo: Lasta

source: Active
eo: Aktiva

source: Popular
eo: Populara

source: Favorites
eo: Favoratoj

source: Posted
eo: Afiŝita

source: Recently active discussions
eo: Laste aktivaj diskutoj

source: Most popular discussions
eo: Plej popularaj diskutoj

source: Most active discussions
eo: Plej aktivaj diskutoj

source: <span class="d-none d-md-inline">Start a n</span><span class="d-md-none">N</span>ew thread
eo: <span class="d-none d-md-inline">Krei novan fadenon</span><span class="d-md-none">Nova fadeno</span>

source: Delete Archive
eo: Forviŝi arĥivon

source: Activity Summary
eo: Resumo pri aktiveco

source: Post volume over the past <strong>30</strong> days.
eo: Nombro de afiŝoj dum la lastaj <strong>30</strong> tagoj.

source: The following statistics are from
eo: Jen la statistikoj de

source: In
eo: En

source: the past <strong>30</strong> days:
eo: la lastaj <strong>30</strong> tagoj:

source: Most active posters
eo: Plej aktivaj afiŝantoj

source: Prominent posters
eo: Elstaraj afiŝantoj

source: kudos
eo: dankoj

source: Search
eo: Serĉi

source: Do it
eo: Ek

source: (there's no undoing!), or
eo: (jen nemalfarebla ago!), aŭ

source: go back to the thread
eo: reen al la fadeno

source: Search results for
eo: Serĉaj rezultoj pri

source: search results
eo: serĉaj rezultoj

source: Search results
eo: Serĉaj rezultoj

source: for query
eo: por serĉo

source: messages
eo: mesaĝoj

source: sort by score
eo: ordigi laŭ poentoj

source: sort by latest first
eo: ordigi de la plej nova ĝis la plej malnova

source: sort by earliest first
eo: ordigi de la plej malnova ĝis la plej nova

source: Sorry no email could be found for this query.
eo: Bedaŭrinde troviĝis neniu retpoŝta mesaĝo pri ĉi tiu serĉo.

source: Sorry but your query looks empty.
eo: Bedaŭrinde via informpeto estas malplena.

source: newer
eo: pli novaj

source: older
eo: malpli novaj

source: Show replies by thread
eo: Montri respondojn laŭ fadeno

source: Show replies by date
eo: Montri respondojn laŭ dato

source: Visit here for a non-javascript version of this page.
eo: Jen versio de ĉi tiu paĝo sen JavaScript.

source: Thread
eo: Fadeno

source: Start a new thread
eo: Krei novan fadenon

source: Click to edit
eo: Alklaku por modifi

source: You must be logged-in to edit.
eo: Vi devas saluti por modifi.

source: no category
eo: sen kategorio

source: Age (days ago)
eo: Aĝo (tagoj antaŭ nuno)

source: Last active (days ago)
eo: Laste aktiva je (tagoj antaŭ nuno)

source: %(num_comments)s comments
eo: %(num_comments)s komentoj

source: %(participants_count)s participants
eo: %(participants_count)s partoprenantoj

source: %(unread_count)s unread <span class="hidden-sm">messages</span>
eo: %(unread_count)s nelegitaj <span class="hidden-sm">mesaĝoj</span>

source: Delete this thread
eo: Forviŝi ĉi tiun fadenon

source: Go to:
eo: Iri al:

source: next
eo: sekven

source: prev
eo: malsekven

source: Most recent thread activity
eo: Plej lasta fadena aktiveco

source: comments
eo: komentoj

source: tags
eo: etikedoj

source: Search for tag
eo: Serĉi etikedon

source: Remove
eo: Forigi

source: Messages by
eo: Mesaĝoj laŭ

source: Back to %(fullname)s's profile
eo: Reen al la profilo de %(fullname)s

source: Sorry no email could be found by this user.
eo: Bedaŭrinde troviĝis neniu retpoŝta mesaĝo far ĉi tiu uzanto.

source: User posting activity
eo: Afiŝa aktiveco de uzanto

source: for
eo: por

source: Threads you have read
eo: Fadenoj legitaj de vi

source: Votes
eo: Voĉdonoj

source: Subscriptions
eo: Abonoj

source: Original author:
eo: Originala aŭtoro:

source: Started on:
eo: Komencita je:

source: Last activity:
eo: Lasta aktiveco:

source: Replies:
eo: Respondoj:

source: Subject
eo: Temo

source: Original author
eo: Originala aŭtoro

source: Start date
eo: Komenca dato

source: Last activity
eo: Lasta aktiveco

source: Replies
eo: Respondoj

source: New comments
eo: Novaj komentoj

source: Nothing read yet.
eo: Neniu legita ankoraŭ.

source: Last posts
eo: Lastaj afiŝoj

source: Date
eo: Dato

source: Last thread activity
eo: Lasta fadena aktiveco

source: No posts yet.
eo: Neniu afiŝo ankoraŭ.

source: since first post
eo: ekde la unua afiŝo

source: post
eo: afiŝo

source: no post yet
eo: neniu afiŝo ankoraŭ

source: First post
eo: Unua afiŝo

source: Posts to this list
eo: Afiŝoj en ĉi tiu listo

source: no subscriptions
eo: sen abonoj

source: You like it
eo: Vi ŝatas ĝin

source: You dislike it
eo: Vi malŝatas ĝin

source: Vote
eo: Voĉdoni

source: No vote yet.
eo: Neniu voĉdono ankoraŭ.

source: User Profile
eo: Profilo de uzanto

source: User profile
eo: Profilo de uzanto

source: Name:
eo: Nomo:

source: Creation:
eo: Kreo:

source: Votes for this user:
eo: Voĉoj por ĉi tiu uzanto:

source: Email addresses:
eo: Retpoŝtaj adresoj:

source: This message in gzipped mbox format
eo: Ĉi tiu mesaĝo en la formo gzip-densigita mbox

source: Successfully deleted %(count)s messages.
eo: Sukcese forviŝis %(count)s mesaĝojn.

source: for this MailingList
eo: por ĉi tiu dissendolisto

source: for this month
eo: por ĉi tiu monato

source: for this day
eo: por ĉi tiu tago

source: This month in gzipped mbox format
eo: Ĉi tiu monato en la dosierformo gzip mbox

source: No discussions this month (yet).
eo: Neniu diskuto ĉi-monato (ankoraŭ).

source: No vote has been cast this month (yet).
eo: Neniu voĉdono ĉi-monate (ankoraŭ).

source: You have not posted to this list (yet).
eo: Vi ne afiŝis al la listo (ankoraŭ).

source: Successfully deleted {}
eo: Sukcese forigis {}

source: Parsing error: %(error)s
eo: Sintaksa eraro: %(error)s

source: This thread in gzipped mbox format
eo: Ĉi tiu fadeno en la formo gzip mbox
