Repository: pypi-data/pypi-mirror-297
Catalog: packages/django-simple-certmanager/django_simple_certmanager-2.4.0.tar.gz/django_simple_certmanager-2.4.0/simple_certmanager/locale/*/LC_MESSAGES/django.po
Languages: nl

source: Subject information
nl: Subjectgegevens

source: The CSR will be generated after entering the information and submitting the data.
nl: De CSR wordt gegenereerd nadat de nodige gegevens ingevuld en ingestuurd zijn.

source: Signing Request (CSR)
nl: Ondertekenverzoek (CSR)

source: Upload Signed Certificate
nl: Digitaal ondertekend certificaat uploaden

source: You do not have permission to download this CSR.
nl: Je hebt onvoldoende rechten om dit CSR te downloaden.

source: Download CSR
nl: CSR downloaden

source: Save the signing request to be able to download it.
nl: Sla het ondertekenverzoek eerst op om het te kunnen downloaden.

source: serial number
nl: serienummer

source: file not found
nl: bestand bestaat niet

source: valid from
nl: geldig vanaf

source: expiry date
nl: vervaldatum

source: valid key pair
nl: geldig sleutelpaar

source: Key-pair
nl: Sleutelpaar

source: Certificate only
nl: Enkel certificaat

source: Upload the public certificate file here. This will be used to verify the signature against the CSR and create the certificate instance.
nl: Upload het ontvangen certificaatbestand hier. We controleren dat dit certificaat overeenkomt met het ondertekenverzoek en maken dan een certificaat-record aan die je in de applicatie kan gebruiken.

source: A certificate already exists for this CSR. Delete the certificate first.
nl: Er bestaat al een certificaat-record voor dit CSR. Verwijder eerst het andere certificaat.

source: Certificate does not match the signature from the actual CSR.
nl: Het certificaat komt niet overeen met de privésleutel van de CSR.

source: Passphrase
nl: Wachtwoordzin

source: Passphrase to decrypt the private key if it's encrypted.
nl: Wachtwoordzin om de privésleutel te ontsleutelen als die versleuteld is.

source: Provide a passphrase to decrypt the private key.
nl: Je moet de wachtwoordzin opgegeven om de privésleutel te ontsleutelen.

source: The private key is not encrypted, a passphrase is not required.
nl: De privésleutel is niet versleuteld, je mag geen wachtwoordzin opgegeven.

source: Could not decrypt the private key with the provided passphrase.
nl: De privésleutel kon niet ontsleuteld worden met de opgegeven wachtwoordzin.

source: The common name for the certificate
nl: De "common name" voor het certificaat.

source: Two-letter country code
nl: 2-letterige landcode, bijvoorbeeld 'NL'.

source: The name of the organization
nl: Naam van de organisatie die in het certificaat vertegenwoordigd wordt.

source: The state or province name
nl: De naam van de provincie.

source: The locality name
nl: Naam van de gemeente/stad.

source: Email address for the certificate
nl: E-mailadres in het certificaat.

source: Signing Request #{pk} for {common_name}
nl: Ondertekenverzoek #{pk} voor {common_name}

source: Recognisable label for the certificate
nl: Label om het certificaat mee te identificeren

source: Is this only a certificate or is there an associated private key?
nl: Gaat het enkel om het certificaat, of is er ook een bijhorende privésleutel?

source: public certificate
nl: publiek certificaat

source: The content of the certificate
nl: De inhoud van het certificaat, in PEM-formaat

source: private key
nl: privésleutel

source: The content of the private key
nl: De inhoud van de privésleutel, in PEM-formaat

source: certificate
nl: certificaat

source: certificates
nl: certificaten

source: (missing label)
nl: (label ontbreekt)

source: Invalid file provided
nl: Ongeldig bestand opgegeven

source: Invalid file provided, expected a certificate in PEM format
nl: Ongeldig bestand, het bestand moet een certificaat in PEM-formaat zijn.

source: Invalid file provided, expected a private key in PEM format
nl: Ongeldig bestand, het bestand moet een privésleutel in PEM-formaat zijn.

source: Private key may not be encrypted.
nl: De privésleutel mag niet versleuteld zijn. Indien je een versleutelde privésleutel toevoegt, zorg er dan voor dat je de juiste wachtwoordzin opgeeft.
