Repository: pypi-data/pypi-mirror-297
Catalog: packages/dc-consent/dc_consent-4.1.5.tar.gz/dc_consent-4.1.5/cookie_consent/locale/*/LC_MESSAGES/django.po
Languages: nl

source: Functional cookies
nl: Functionele cookies

source: These cookies are required for the website to function.
nl: Deze cookies zijn nodig voor de website om te functioneren.

source: Functional cookies are required for the website to function. They are usually only set in response to actions made by you which amount to a request for services, such as setting your privacy preferences, logging in or filling in forms. You can set your browser to block or alert you about these cookies, but some parts of the site will not then work. These cookies do not store any personally identifiable information.
nl: Functionele cookies zijn nodig voor de website om te functioneren. Ze worden meestal alleen ingesteld als reactie op acties die u uitvoert die neerkomen op een verzoek om diensten, zoals het instellen van uw privacyvoorkeuren, inloggen of formulieren invullen. U kunt uw browser instellen om deze cookies te blokkeren of om u voor deze cookies te waarschuwen, maar sommige delen van de site werken dan niet. Deze cookies slaan geen persoonlijk identificeerbare informatie op.

source: Analytics cookies
nl: Analytische cookies

source: This site uses analytics cookies to improve your experience.
nl: Deze website gebruikt analytische cookies om uw ervaring te verbeteren.

source: Analytics cookies allow us to count visits and traffic sources, so we can measure and improve the performance of our site. They help us know which pages are the most and least popular and see how visitors move around the site. All information these cookies collect is aggregated and therefore anonymous. If you do not allow these cookies, we will not know when you have visited our site.
nl: Analytische cookies stellen ons in staat om bezoeken en verkeersbronnen te tellen, zodat we de prestaties van onze site kunnen meten en verbeteren. Ze helpen ons te weten welke pagina's het meest en het minst populair zijn en zien hoe bezoekers zich op de site verplaatsen. Alle informatie die deze cookies verzamelen, is geaggregeerd en daarom anoniem.

source: This site uses marketing cookies to improve your experience.
nl: Deze website gebruikt marketing cookies om uw ervaring te verbeteren.

source: Marketing cookies are used to track visitors across websites. The intention is to display ads that are relevant and engaging for the individual user and thereby more valuable for publishers and third party advertisers. If you do not allow these cookies, you will experience less targeted advertising.
nl: Marketing cookies worden gebruikt om bezoekers over websites heen te volgen. Het is de bedoeling om advertenties weer te geven die relevant en aantrekkelijk zijn voor de individuele gebruiker en daardoor waardevoller zijn voor uitgevers en externe adverteerders. Als u deze cookies niet toestaat, zult u minder gerichte advertenties ervaren.

source: This site uses cookies to improve your experience.
nl: Deze website gebruikt cookies om uw ervaring te verbeteren.

source: Accept
nl: Accepteren

source: Accept All
nl: Alles Accepteren

source: Decline
nl: Weigeren

source: Settings
nl: Instellingen

source: Open link in a new tab
nl: Open link in een nieuw tabblad

source: Good Advice IT is not liable for any direct, indirect, incidental, consequential, or punitive damages arising from the use of this website or its content.
nl: Good Advice IT is niet aansprakelijk voor enige directe, indirecte, incidentele, gevolgschade of strafrechtelijke schade die voortvloeit uit het gebruik van deze website of de inhoud ervan.

source: Back
nl: Terug

source: Cookie Policy/Statement
nl: Cookiebeleid/verklaring

source: Revoke Cookie Consent
nl: Cookie toestemming intrekken
